Documents/УсловияПримененияСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>УсловияПримененияСтавок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИпотечныеСтавки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУсловияПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловияПримененияСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыУсловийСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСтавок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИпотечныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ИпотечныеСтавки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активен1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаУсловийСтавок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыУсловийСтавки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУсловияПримененияСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУсловияПримененияСтавок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УсловияПримененияСтавок/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ Юкаев Роман 20180425 (//
	//СнятьАктивностьПредыдущих();
	//
	//Если ВидОперации <> Перечисления.ВидыОперацийУсловияПримененияСтавок.Отмена Тогда
	//	СформироватьДвижения();
	//КонецЕсли;
	
	Движения.ИпотечныеСтавки.Записывать = Истина;
	Движения.ИпотечныеСтавки.Очистить();
	
	//снимаем активность предыдущих ставок
	Выборка = СформироватьВыборкуПоПредыдущимЗначениям();
	
	Если Выборка <> Неопределено Тогда
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ИпотечныеСтавки.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка,, "Активен");
			Движение.Активен = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийУсловияПримененияСтавок.Отмена Тогда
		
		Для Каждого Стр Из ЗначенияСтавок Цикл
			Движение = Движения.ИпотечныеСтавки.Добавить();
			Движение.Активен = Истина;
			Движение.Активен1 = Истина;
			Движение.Банк = Банк;
			Движение.Группа = Стр.Группа;
			Движение.Параметр = Стр.Параметр;
			Движение.Период = ДатаРегистрации;
			Движение.ПрограммаКредитования = Программа;
			Движение.Расположение = Стр.Расположение;
			Движение.Ставка = Стр.Ставка;
			Движение.СхемаУсловийСтавок = СхемаУсловияПримененияСтавки;
			Движение.Тип = Стр.Тип;
		КонецЦикла;
	КонецЕсли;
	//-- Юкаев Роман 20180425 )
	
КонецПроцедуры

//++ Юкаев Роман 20180425 (//
Функция СформироватьВыборкуПоПредыдущимЗначениям()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Дата КАК Период,
		|	ИпотечныеСтавкиСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	ИпотечныеСтавкиСрезПоследних.Активность КАК Активность,
		|	ИпотечныеСтавкиСрезПоследних.Банк КАК Банк,
		|	ИпотечныеСтавкиСрезПоследних.Тип КАК Тип,
		|	ИпотечныеСтавкиСрезПоследних.Параметр КАК Параметр,
		|	ИпотечныеСтавкиСрезПоследних.Группа КАК Группа,
		|	ИпотечныеСтавкиСрезПоследних.СхемаУсловийСтавок КАК СхемаУсловийСтавок,
		|	ИпотечныеСтавкиСрезПоследних.Ставка КАК Ставка,
		|	ИпотечныеСтавкиСрезПоследних.Активен КАК Активен,
		|	ИпотечныеСтавкиСрезПоследних.Расположение КАК Расположение,
		|	ИпотечныеСтавкиСрезПоследних.ПрограммаКредитования КАК ПрограммаКредитования,
		|	ИпотечныеСтавкиСрезПоследних.Активен1 КАК Активен1
		|ИЗ
		|	РегистрСведений.ИпотечныеСтавки.СрезПоследних(
		|			&Дата,
		|			Банк = &Банк
		|				И ПрограммаКредитования = &Программа
		|				И СхемаУсловийСтавок = &Схема
		|				И Регистратор <> &Ссылка) КАК ИпотечныеСтавкиСрезПоследних
		|ГДЕ
		|	ИпотечныеСтавкиСрезПоследних.Активен
		|
		|ДЛЯ ИЗМЕНЕНИЯ";
	
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("Дата", ДатаРегистрации);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Программа", Программа);
	Запрос.УстановитьПараметр("Схема", СхемаУсловияПримененияСтавки);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Возврат Выборка;
	КонецЕсли;
	
КонецФункции
//-- Юкаев Роман 20180425 )

//Процедура СнятьАктивностьПредыдущих()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	&Дата КАК Период,
//		|	ИпотечныеСтавкиСрезПоследних.НомерСтроки,
//		|	ИпотечныеСтавкиСрезПоследних.Активность,
//		|	ИпотечныеСтавкиСрезПоследних.Банк,
//		|	ИпотечныеСтавкиСрезПоследних.Тип,
//		|	ИпотечныеСтавкиСрезПоследних.Параметр,
//		|	ИпотечныеСтавкиСрезПоследних.Группа,
//		|	ИпотечныеСтавкиСрезПоследних.СхемаУсловийСтавок,
//		|	ИпотечныеСтавкиСрезПоследних.Ставка,
//		|	ИпотечныеСтавкиСрезПоследних.Активен,
//		|	ИпотечныеСтавкиСрезПоследних.Расположение,
//		|	ИпотечныеСтавкиСрезПоследних.ПрограммаКредитования
//		|ИЗ
//		|	РегистрСведений.ИпотечныеСтавки.СрезПоследних(
//		|			&Дата,
//		|			Банк = &Банк
//		|				И ПрограммаКредитования = &Программа
//		|				И СхемаУсловийСтавок = &Схема
//		|				И Регистратор <> &Ссылка) КАК ИпотечныеСтавкиСрезПоследних
//		|ГДЕ
//		|	ИпотечныеСтавкиСрезПоследних.Активен
//		|
//		|ДЛЯ ИЗМЕНЕНИЯ";
//	
//	Запрос.УстановитьПараметр("Банк", Банк);
//	Запрос.УстановитьПараметр("Дата", ДатаРегистрации);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.УстановитьПараметр("Программа", Программа);
//	Запрос.УстановитьПараметр("Схема", СхемаУсловияПримененияСтавки);
//	
//	НачатьТранзакцию();
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//	Набор = ЭтотОбъект.Движения.ИпотечныеСтавки;
//	
//	Запись = Набор.Добавить();
//	
//	ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);		
//	Запись.Активен = Ложь;
//	
//	Попытка
//		Набор.Записать();
//	Исключение
//		Информация = ИнформацияОбОшибке();
//		Ошибка = ОписаниеОшибки();
//		Если Найти(Ошибка, "Запись с такими ключевыми полями существует!")<>0 Тогда
//			Сообщить("По этой схеме на дату регистрации уже существует другой документ ""Условия применения ставок"""); 
//			//+ Символы.ПС +	Информация.Причина.Описание);
//		Иначе
//			ВызватьИсключение;
//		КонецЕсли;
//	КонецПопытки;

//	КонецЦикла;
//	ЗафиксироватьТранзакцию();
//	
//КонецПроцедуры

//Процедура СформироватьДвижения()
//	
//	
//	Набор = РегистрыСведений.ИпотечныеСтавки.СоздатьНаборЗаписей();
//	Набор.Отбор.Регистратор.Установить(Ссылка);
//	Набор.Прочитать();
//	Набор.Очистить();
//	Для Каждого Стр Из ЗначенияСтавок Цикл
//		Запись = Набор.Добавить();
//		ЗаполнитьЗначенияСвойств(Запись, Стр,,"НомерСтроки");
//		Запись.Активен = Истина;
//		Запись.Период = ДатаРегистрации;
//		Запись.СхемаУсловийСтавок = СхемаУсловияПримененияСтавки;
//		Запись.ПрограммаКредитования = Программа;
//		Запись.Банк = Банк;
//	КонецЦикла;
//	
//	Набор.Записать();
//	
//КонецПроцедуры
